apache/nuttx/arch/arm/src/rp2040/rp2040_cyw43439.c
/****************************************************************************
 * arch/arm/src/rp2040/rp2040_cyw43439.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdio.h>
#include <debug.h>
#include <errno.h>

#include <nuttx/kmalloc.h>
#include <nuttx/signal.h>
#include <nuttx/wireless/ieee80211/bcmf_gspi.h>
#include <arch/barriers.h>

#include "rp2040_cyw43439.h"
#include "rp2040_pio.h"
#include "rp2040_pio_instructions.h"

#ifdef CONFIG_NDEBUG
#  define PRINT_GSPI(block)
#else
void bcmf_hexdump(uint8_t *data, unsigned int len, unsigned long offset);
bool  g_print_gspi = false;
#  define PRINT_GSPI(block) if (g_print_gspi) { block }
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define GSPI_CLOCK_FREQ 31250000  /* Hz  (Max: 50MHz) */

#define PIO_WRAP_TARGET 0
#define PIO_WRAP        5

#define TX_FIFO_SIZE    4

/****************************************************************************
 * Private Type Definitions
 ****************************************************************************/

typedef struct dma_info_s
{
  sem_t         sem;
  uint8_t       status;
} dma_info_t;

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* This is the PIO program to write and then read from the data pin.
 *
 * The X register is the output bit count register.  It should be set
 * to one less than the total number of BITS to be transmitted.
 *
 * The Y register is the input bit count register.  It too must be set
 * to one less than the total number of bits to be read.
 *
 * The PIO's state machine is set up to auto-pull data from the input
 * fifo whenever the output shift register is empty.  This happens at
 * the start and every 32 bits thereafter.
 *
 * The state machine also auto-pushes whenever we have a full 32 bits
 * in the input shift register.  To make sure we receive all the data,
 * we need to make sure that the read bit count is a multiple of 32.
 * (Y = 32*N - 1  for some integer N)
 */

static const uint16_t cyw_program_instructions[] =
{
  0x6001, /* 0: out  pins, 1     side 0 # Write one bit                  */
  0x1040, /* 1: jmp  x--, 0      side 1 # Loop until write count is zero */
  0xe080, /* 2: set  pindirs, 0  side 0 # Make data pin an input         */
  0xb042, /* 3: nop              side 1 # Keep clock in sync             */
  0x4001, /* 4: in   pins, 1     side 0 # Read 1 bit                     */
  0x1084, /* 5: jmp  y--, 4      side 1 # Loop until read count is zero  */
};

static const rp2040_pio_program_t pio_program =
{
  .instructions = cyw_program_instructions,
  .length       = 6,    /* Six, count 'em, six.    */
  .origin       = -1,   /* Put it wherever it fits */
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: dma_complete
 *
 * Description:
 *   Called on completion of the DMA transfer.
 *
 * Input Parameters:
 *   handle - handle to our DMA channel
 *   status - status of the transfer
 *   arg    - Pointer to dma info structure.
 *
 ****************************************************************************/

static void dma_complete(DMA_HANDLE handle, uint8_t status, void *arg)
{
  dma_info_t *dma_info = arg;

  /* Remember the status and post the dma complete event. */

  dma_info->status = status;
  nxsem_post(&(dma_info->sem));
}

/****************************************************************************
 * Name: my_init
 *
 * Description:
 *   Connect to and initialize the cyw43439.
 *
 ****************************************************************************/

static int my_init(gspi_dev_t  *gspi)
{
  rp2040_gspi_t *rp_io = (rp2040_gspi_t *)(gspi->io_dev);

  uint32_t              divisor;
  irqstate_t            flags;
  rp2040_pio_sm_config  config =
    {
      0
    };

  /* Make sure the cyw43439 chip is deselected, and off.
   * so we know it is reset
   */

  rp2040_gpio_put(rp_io->gpio_select, true);  /* deselect  */
  rp2040_gpio_put(rp_io->gpio_on, false);     /* power off */

  /* Pull the data line low so that we initialise to gSPI mode */

  rp2040_gpio_init(rp_io->gpio_data);
  rp2040_gpio_setdir(rp_io->gpio_data, true);
  rp2040_gpio_put(rp_io->gpio_data, false);

  nxsig_usleep(50000); /* Leave off for at least 50ms. */

  rp2040_gpio_put(rp_io->gpio_on, true);     /* power on */

  nxsig_usleep(50000); /* Wait a bit to let the power come up. */

  /* Don't let anyone else grab a PIO while we are doing so. */

  flags = enter_critical_section();

  /* Find a PIO instance and load program. */

  for (rp_io->pio = 0; rp_io->pio < RP2040_PIO_NUM; ++rp_io->pio)
    {
      /* Try to claim a state machine. */

      rp_io->pio_sm = rp2040_pio_claim_unused_sm(rp_io->pio, false);

