apache/nuttx/arch/arm/src/rp2040/rp2040_cyw43439.c
      /* If we did not get one try the next pio block, if any. */

      if (rp_io->pio_sm < 0) continue;

      /* See if we have space in this block to load our program. */

      if (rp2040_pio_can_add_program(rp_io->pio, &pio_program))
        {
          /* Great! load the program and exit the pio choice loop. */

          rp_io->pio_location = rp2040_pio_add_program(rp_io->pio,
                                                      &pio_program);

          break;
        }

      /* Oops -- no room at the inn!  Release sm and try next pio. */

      rp2040_pio_sm_unclaim(rp_io->pio, rp_io->pio_sm);
    }

  if (rp_io->pio >= RP2040_PIO_NUM)
    {
      leave_critical_section(flags);
      return -ENOMEM;
    }

  leave_critical_section(flags);

  /* ==== Configure the PIO State Machine ==== */

  /* Configure pins that are used by PIO. */

  rp2040_pio_gpio_init(rp_io->pio, rp_io->gpio_data);
  rp2040_pio_gpio_init(rp_io->pio, rp_io->gpio_clock);

  rp2040_gpio_set_input_hysteresis_enabled(rp_io->gpio_data, true);

  rp2040_gpio_set_slew_fast(rp_io->gpio_clock, true);
  rp2040_gpio_set_drive_strength(rp_io->gpio_clock,
                                 RP2040_PADS_BANK0_GPIO_DRIVE_12MA);

  /* Set the clock divisor as appropriate for our system clock
   * speed, so the pio clock runs the requested bit clock rate.
   */

  divisor = ((uint64_t)BOARD_SYS_FREQ << 8) / (2 * GSPI_CLOCK_FREQ);

  rp2040_sm_config_set_clkdiv_int_frac(&config,
                                       divisor >> 8,
                                       divisor & 0xff);

  /* Set the wrap points as required by the program. */

  rp2040_sm_config_set_wrap(&config,
                            rp_io->pio_location + PIO_WRAP_TARGET,
                            rp_io->pio_location + PIO_WRAP);

  /* set to shift left, 32 bits, with autopull/push  */

  rp2040_sm_config_set_in_shift(&config, false, true, 32);
  rp2040_sm_config_set_out_shift(&config, false, true, 32);

  /* Configure a single mandatory side-set pin. */

  rp2040_sm_config_set_sideset(&config, 1, false, false);

  /* Configure our GPIO clock pin as side-set output. */

  rp2040_sm_config_set_sideset_pins(&config, rp_io->gpio_clock);

  /* Configure out GPIO data pin as an OUT pin, SET pin, and IN pin */

  rp2040_sm_config_set_out_pins(&config, rp_io->gpio_data, 1);
  rp2040_sm_config_set_set_pins(&config, rp_io->gpio_data, 1);
  rp2040_sm_config_set_in_pins (&config, rp_io->gpio_data);

  /* Load the configuration into the state machine. */

  rp2040_pio_sm_init(rp_io->pio,
                     rp_io->pio_sm,
                     rp_io->pio_location,
                     &config);

  /* Disable the input synchronizers on the data pin */

  rp2040_pio_set_input_sync_bypass(rp_io->pio, rp_io->gpio_data, true);

  wlinfo("finished\n");

  return OK;
}

/****************************************************************************
 * Name: my_set_isr
 *
 * Description:
 *   Setup the data line interrupt service routine.
 *
 ****************************************************************************/

static int my_set_isr(gspi_dev_t  *gspi,
                      xcpt_t           thread_isr,
                      void        *thread_isr_arg)
{
  rp2040_gspi_t *rp_io = (rp2040_gspi_t *)(gspi->io_dev);

  /* Set up, but do not enable, interrupt service for the data pin */

  rp2040_gpio_irq_attach(rp_io->gpio_intr,
                         RP2040_GPIO_INTR_LEVEL_HIGH,
                         thread_isr,
                         thread_isr_arg);

  wlinfo("attached\n");

  return OK;
}

/****************************************************************************
 * Name: my_interrupt_enable
 *
 * Description:
 *   Setup the data line isr.
 *
 ****************************************************************************/

static int my_interrupt_enable(gspi_dev_t  *gspi,
                               bool             enable)
{
  rp2040_gspi_t *rp_io         = (rp2040_gspi_t *)(gspi->io_dev);
  static int         disable_count = 0;

  if (enable)
    {
      if (--disable_count <= 0) rp2040_gpio_enable_irq(rp_io->gpio_intr);
    }
  else
    {
      rp2040_gpio_disable_irq(rp_io->gpio_intr);
      ++disable_count;
    }

  return OK;
}

/****************************************************************************
 * Name: my_deinit
 *
 * Description:
 *   Disconnect from cyw43439 and cleanup.
 *
 ****************************************************************************/

static int my_deinit(gspi_dev_t *gspi)
{
  rp2040_gspi_t *rp_io = (rp2040_gspi_t *)(gspi->io_dev);

  rp2040_gpio_irq_attach(rp_io->gpio_data,
                         RP2040_GPIO_INTR_EDGE_LOW,
                         NULL,
                         NULL);

  rp2040_pio_sm_set_enabled(rp_io->pio, rp_io->pio_sm, false);
  rp2040_pio_remove_program(rp_io->pio, &pio_program, rp_io->pio_location);
  rp2040_pio_sm_unclaim(rp_io->pio, rp_io->pio_sm);

  /* Turn the power off to the cyw43439. */

  rp2040_gpio_put(rp_io->gpio_on, false);

  return OK;
}

/****************************************************************************
 * Name: my_write
 *
 * Description:
 *   write data to the cyw43439
 *
 ****************************************************************************/

static int my_write(struct gspi_dev_s   *gspi,
                    bool                 increment,
                    enum gspi_cmd_func_e function,
                    uint32_t             address,
                    uint16_t             length,
                    const uint32_t      *data)
{
  rp2040_gspi_t *rp_io      = (rp2040_gspi_t *)(gspi->io_dev);
  dma_info_t         dma_info;
  DMA_HANDLE         xfer_dma   = rp2040_dmachannel();
  uint32_t           command    =    (0x1                  << 31)
                                   | ((increment ? 1 : 0)  << 30)
                                   | ((function & 0x3)     << 28)
                                   | ((address  & 0x1ffff) << 11)
                                   | (length    & 0x7ff);

  dma_config_t       dma_config =
    {
      .size   = RP2040_DMA_SIZE_WORD,
      .noincr = false,
      .dreq   = rp2040_pio_get_dreq(rp_io->pio,
                                    rp_io->pio_sm,
                                    true),
    };

  PRINT_GSPI(
    printf("------ cmd: 0x%08lx [W %d %d 0x%05lX %d]\n", command,
                                                         increment,
                                                         function,
                                                         address,
                                                         length);
    bcmf_hexdump((void *)data, length, (uint32_t)data);
  )

  /* Claim the exclusive lock */

  nxmutex_lock(&gspi->lock);

  /* Reset the PIO state machine just to be sure. */

  rp2040_pio_sm_set_enabled(rp_io->pio, rp_io->pio_sm, false);

  rp2040_pio_sm_clear_fifos(rp_io->pio, rp_io->pio_sm);

