apache/nuttx/arch/arm/src/rp2040/rp2040_cyw43439.c
  rp2040_pio_sm_restart(rp_io->pio, rp_io->pio_sm);

  rp2040_pio_sm_clkdiv_restart(rp_io->pio, rp_io->pio_sm);

  rp2040_pio_sm_exec(rp_io->pio,
                     rp_io->pio_sm,
                     pio_encode_jmp(rp_io->pio_location));

  /* Set the PIO X and Y registers.
   *
   * We load X (the TX bit length) with one less than the number of
   * bits to transmit to the chip. This length includes the 32-bit
   * command word and all the 32-bit data words. Since the length
   * parameter is a byte count we round up just to be sure.
   *
   * We load Y (the RX bit length) with zero as we're not reading
   * any data.
   *
   * This is slightly magical.  The way we load the X is to first
   * push the the number of bits to transmit onto the transmit fifo.
   * Then we force the PIO state machine to execute the instruction
   * "out x, 32" which transfers the word from the output shift
   * register (OSR) to the X register.  When this instruction executes
   * the PIO will notice that the OSR is empty, so will automatically
   * pull a value (the one we just added) from the input fifo.
   *
   * Loading the Y works the same way.
   */

  rp2040_pio_sm_put(rp_io->pio, rp_io->pio_sm, 32 * ((length + 3) / 4) + 31);
  rp2040_pio_sm_exec(rp_io->pio, rp_io->pio_sm, pio_encode_out(pio_x, 32));

  rp2040_pio_sm_put(rp_io->pio, rp_io->pio_sm, 0);
  rp2040_pio_sm_exec(rp_io->pio, rp_io->pio_sm, pio_encode_out(pio_y, 32));

  /* Disable interrupts so data won't trigger interrupt. */

  my_interrupt_enable(gspi, false);

  /* Make sure the clock and data pins direction set to output. */

  rp2040_pio_sm_set_pindirs_with_mask(rp_io->pio,
                                      rp_io->pio_sm,
                                        (1 << rp_io->gpio_data)
                                      | (1 << rp_io->gpio_clock),
                                        (1 << rp_io->gpio_data)
                                      | (1 << rp_io->gpio_clock));

  /* Make sure there is nothing in the fifos before starting DMA. */

  rp2040_pio_sm_clear_fifos(rp_io->pio, rp_io->pio_sm);

  /* Load the command into the transmit fifo. */

  if (function == gspi_f0_bus_rev16)
    {
      __asm ("rev16 %0, %0" : "+l" (command) : :);
    }

  __asm ("rev %0, %0" : "+l" (command) : :);

  putreg32(command, RP2040_PIO_TXF(rp_io->pio, rp_io->pio_sm));

  /* Initialize and start the transmit DMA.  It will
   * keep adding data to the TX_FIFO until all data is sent.
   */

  nxsem_init(&dma_info.sem, 0, 0);

  rp2040_dmastop(xfer_dma);

  rp2040_txdmasetup(xfer_dma,
                    (uintptr_t) RP2040_PIO_TXF(rp_io->pio,
                                                rp_io->pio_sm),
                    (uintptr_t) data,
                    (length + 3) & 0xfffffffc,
                    dma_config);

  modifyreg32(rp2040_dma_register(xfer_dma,
                                  RP2040_DMA_CTRL_TRIG_OFFSET),
                                  RP2040_DMA_CTRL_TRIG_BSWAP,
                                  RP2040_DMA_CTRL_TRIG_BSWAP);

  rp2040_dmastart(xfer_dma, dma_complete, &dma_info);

  /* Assert gpio_select by pulling line low */

  rp2040_gpio_put(rp_io->gpio_select, false);
  UP_DMB();

  /* Enable the state machine.  This starts the pio program running */

  rp2040_pio_sm_set_enabled(rp_io->pio, rp_io->pio_sm, true);

  /* Wait for transfer to complete */

  nxsem_wait(&dma_info.sem);

  /* At this point all the data has been queued but my not have all been
   * sent.  We know that the PIO program will make the data line an input
   * once all the data is sent so we'll check for this.
   */

  while (getreg32(RP2040_IO_BANK0_GPIO_STATUS(rp_io->gpio_data))
                  & RP2040_IO_BANK0_GPIO_STATUS_OEFROMPERI)
    {
      /* Just busy wait -- testing indicates a worst case of
       * 20 loops (100 instructions).
       */
    }

  /* Un-assert select by pulling line high. */

  UP_DMB();
  rp2040_gpio_put(rp_io->gpio_select, true);

  /* Free the DMA controller */

  rp2040_dmafree(xfer_dma);
  nxsem_destroy(&dma_info.sem);

  /* Disable the PIO */

  rp2040_pio_sm_set_enabled(rp_io->pio, rp_io->pio_sm, false);

  /* At this point the data pin is input so it should have been
   * pulled high by rp2040's gpio pullup.
   */

  my_interrupt_enable(gspi, true);

  /* Release the exclusive lock */

  nxmutex_unlock(&gspi->lock);
  return dma_info.status;
}

/****************************************************************************
 * Name: my_read
 *
 * Description:
 *   read data to the cyw43439
 *
 ****************************************************************************/

static int my_read(struct gspi_dev_s   *gspi,
                   bool                 increment,
                   enum gspi_cmd_func_e function,
                   uint32_t             address,
                   uint16_t             length,
                   uint32_t            *buffer)
{
  rp2040_gspi_t *rp_io      = (rp2040_gspi_t *)(gspi->io_dev);
  dma_info_t     dma_info;
  DMA_HANDLE     xfer_dma   = rp2040_dmachannel();
  DMA_HANDLE     ctrl_dma   = rp2040_dmachannel();
  uint32_t       temp_word;
  uint32_t       bit_length;
  uint32_t       command    = ((increment ? 1 : 0) << 30)
                            | ((function & 0x3)    << 28)
                            | ((address & 0x1ffff) << 11)
                            | (length & 0x7ff);

  uint32_t       pacing     = rp2040_pio_get_dreq(rp_io->pio,
                                                  rp_io->pio_sm,
                                                  false);

  dma_control_block_t ctrl_blks[] =
    {
      /* For F1 transfers we read 1 word that we throw away */

        {
          rp2040_dma_ctrl_blk_ctrl(ctrl_dma,
                                    RP2040_DMA_SIZE_WORD,
                                    pacing,
                                    0),
          (uintptr_t) RP2040_PIO_RXF(rp_io->pio, rp_io->pio_sm),
          (uintptr_t) &temp_word,
          1,
        },

      /* Read requested data into output buffer */

        {
          rp2040_dma_ctrl_blk_ctrl(ctrl_dma,
                                    RP2040_DMA_SIZE_WORD,
                                    pacing,
                                      RP2040_DMA_CTRL_TRIG_INCR_WRITE
                                    | RP2040_DMA_CTRL_TRIG_BSWAP),
          (uintptr_t) RP2040_PIO_RXF(rp_io->pio, rp_io->pio_sm),
          (uintptr_t) buffer,
          (length + 3) / 4,
        },

