apache/nuttx/arch/arm/src/rp2040/rp2040_cyw43439.c
      RP2040_DMA_CTRL_BLOCK_END
    };

  PRINT_GSPI(
    printf("------ cmd: 0x%08lx [R %d %d 0x%05lX %d]\n", command,
                                                         increment,
                                                         function,
                                                         address,
                                                         length);
  )

  /* Claim the exclusive lock */

  nxmutex_lock(&gspi->lock);

  /* Reset the PIO state machine just to be sure. */

  rp2040_pio_sm_set_enabled(rp_io->pio, rp_io->pio_sm, false);

  rp2040_pio_sm_clear_fifos(rp_io->pio, rp_io->pio_sm);

  rp2040_pio_sm_restart(rp_io->pio, rp_io->pio_sm);

  rp2040_pio_sm_clkdiv_restart(rp_io->pio, rp_io->pio_sm);

  rp2040_pio_sm_exec(rp_io->pio,
                     rp_io->pio_sm,
                     pio_encode_jmp(rp_io->pio_location));

  /* Set the PIO X and Y registers.
   *
   * We load X (the TX bit length) with one less than the number of
   * bits to transmit to the chip. Since we only send the 32-bit command
   * word we set X to 31.
   *
   * We load Y with the number of bits to read.  This is based on the
   * byte count in "length" which we round up to a 32-bit boundary so the
   * pio program will be sure to autopush the final data to the output fifo.
   *
   * This is slightly magical.  The way we load the X is to first
   * push the the number of bits to transmit onto the transmit fifo.
   * Then we force the PIO state machine to execute the instruction
   * "out x, 32" which transfers the word from the output shift
   * register (OSR) to the X register.  When this instruction executes
   * the PIO will notice that the OSR is empty, so will automatically
   * pull a value (the one we just added) from the input fifo.
   *
   * Loading the Y works the same way.
   */

  rp2040_pio_sm_put(rp_io->pio, rp_io->pio_sm, 31);
  rp2040_pio_sm_exec(rp_io->pio, rp_io->pio_sm, pio_encode_out(pio_x, 32));

  /* RX bit length is 32 bits for each 4 bytes requested. */

  bit_length = 32 * ((length + 3) / 4);

  /* For F1 reads add 32 bits for delay */

  if (function == gspi_f1_backplane)
    {
      bit_length += 32;
    }

  rp2040_pio_sm_put(rp_io->pio, rp_io->pio_sm, bit_length);
  rp2040_pio_sm_exec(rp_io->pio, rp_io->pio_sm, pio_encode_out(pio_y, 32));

  /* Disable interrupts so data won't trigger interrupt. */

  my_interrupt_enable(gspi, false);

  /* Make sure the clock and data pins direction set to output. */

  rp2040_pio_sm_set_pindirs_with_mask(rp_io->pio,
                                      rp_io->pio_sm,
                                        (1 << rp_io->gpio_data)
                                      | (1 << rp_io->gpio_clock),
                                        (1 << rp_io->gpio_data)
                                      | (1 << rp_io->gpio_clock));

  /* Make sure there is nothing in the fifos before starting DMA. */

  rp2040_pio_sm_clear_fifos(rp_io->pio, rp_io->pio_sm);

  /* Load the command into the transmit fifo. */

  if (function == gspi_f0_bus_rev16)
    {
      __asm ("rev16 %0, %0" : "+l" (command) : :);
    }

  __asm ("rev %0, %0" : "+l" (command) : :);

  putreg32(command, RP2040_PIO_TXF(rp_io->pio, rp_io->pio_sm));

  /* Initialize and start the control DMA.  It will
   * use the xfer_dma to transfer data from the chip.
   */

  nxsem_init(&dma_info.sem, 0, 0);

  rp2040_dmastop(ctrl_dma);
  rp2040_dmastop(xfer_dma);

  /* Check the function bits if the command word to see if
   * this is an F1 read.  If it is we throw away the first
   * four bytes read as this is a delay word.
   */

  rp2040_ctrl_dmasetup(ctrl_dma,
                       xfer_dma,
                       &ctrl_blks[function == 1 ? 0 : 1],
                       dma_complete,
                       &dma_info);

  rp2040_dmastart(ctrl_dma, NULL, NULL);

  /* Assert gpio_select by pulling line low */

  rp2040_gpio_put(rp_io->gpio_select, false);
  UP_DMB();

  /* Enable the state machine.  This starts the pio program running */

  rp2040_pio_sm_set_enabled(rp_io->pio, rp_io->pio_sm, true);

  /* Wait for transfer to complete */

  nxsem_wait(&dma_info.sem);

  PRINT_GSPI(
    bcmf_hexdump((void *)buffer, length, (uint32_t)buffer);
  )

  /* Un-assert select by pulling line high. */

  UP_DMB();
  rp2040_gpio_put(rp_io->gpio_select, true);

  /* Free the DMA controllers */

  rp2040_dmafree(ctrl_dma);
  rp2040_dmafree(xfer_dma);

  nxsem_destroy(&dma_info.sem);

  /* Disable the PIO */

  rp2040_pio_sm_set_enabled(rp_io->pio, rp_io->pio_sm, false);

  /* At this point the data pin is input so it should have been
   * pulled high by rp2040's gpio pullup.
   */

  my_interrupt_enable(gspi, true);

  /* Release the exclusive lock */

  nxmutex_unlock(&gspi->lock);
  return dma_info.status;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: rp2040_cyw_setup
 *
 * Description:
 *   Initialize the cyw43439 private data and PIO communication.
 ****************************************************************************/

gspi_dev_t *rp2040_cyw_setup(uint8_t gpio_on,
                             uint8_t gpio_select,
                             uint8_t gpio_data,
                             uint8_t gpio_clock,
                             uint8_t gpio_intr)
{
  gspi_dev_t    *gspi;
  rp2040_gspi_t *rp_io;
  int            err;

  wlinfo("entered.\n");

  gspi = kmm_zalloc(sizeof(gspi_dev_t));

  if (gspi == NULL)
    {
      set_errno(ENOMEM);
      return NULL;
    }

  rp_io = kmm_zalloc(sizeof(rp2040_gspi_t));

  if (rp_io == NULL)
    {
      kmm_free(gspi);
      set_errno(ENOMEM);
      return NULL;
    }

  gspi->init             = my_init;
  gspi->deinit           = my_deinit;
  gspi->set_isr          = my_set_isr;
  gspi->interrupt_enable = my_interrupt_enable;
  gspi->write            = my_write;
  gspi->read             = my_read;
  gspi->io_dev           = rp_io;

  rp_io->gpio_on     = gpio_on;
  rp_io->gpio_select = gpio_select;
  rp_io->gpio_data   = gpio_data;
  rp_io->gpio_clock  = gpio_clock;
  rp_io->gpio_intr   = gpio_intr;

  nxmutex_init(&gspi->lock);

  /* Initialize the cyw43439 power-on and chip select lines. */

  rp2040_gpio_init(gpio_on);
  rp2040_gpio_setdir(gpio_on, true);
  rp2040_gpio_put(gpio_on, false);  /* set low to turn wifi chip off */

  rp2040_gpio_init(gpio_select);
  rp2040_gpio_setdir(gpio_select, true);
  rp2040_gpio_put(gpio_select, true); /* set high to deselect chip */

  err = bcmf_gspi_initialize(gspi);

  if (err != OK)
    {
      kmm_free(gspi);
      kmm_free(rp_io);

      set_errno(err);
      return NULL;
    }

  wlinfo("setup complete. gspi = 0x%p\n", gspi);

  return gspi;
}

/****************************************************************************
 * Name: rp2040_cyw_remove
 *
 * Description:
 *   Deinitialize the cyw43439 PIO communication.
 ****************************************************************************/

void rp2040_cyw_remove(gspi_dev_t *gspi)
{
  /* gspi_deregister((gspi_dev_t *)gspi); */
}

/****************************************************************************
 * Name: bcmf_board_etheraddr
 ****************************************************************************/

bool bcmf_board_etheraddr(struct ether_addr *ethaddr)
{
  return false;
}
